<?php

namespace Database\Seeders;
use App\Models\Ref_06;
use Illuminate\Database\Eloquent\Factories\Sequence;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class Ref06Seeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        Ref_06::factory(35)->state(new sequence(
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '001','ref_06004' => '1'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '002','ref_06004' => '1'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '003','ref_06004' => '1'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '004','ref_06004' => '1'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '005','ref_06004' => '1'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '006','ref_06004' => '2'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '007','ref_06004' => '2'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '008','ref_06004' => '2'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '009','ref_06004' => '2'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '010','ref_06004' => '2'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '011','ref_06004' => '3'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '012','ref_06004' => '3'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '013','ref_06004' => '3'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '014','ref_06004' => '3'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '015','ref_06004' => '3'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '016','ref_06004' => '4'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '017','ref_06004' => '4'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '018','ref_06004' => '4'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '019','ref_06004' => '4'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '020','ref_06004' => '4'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '021','ref_06004' => '5'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '022','ref_06004' => '5'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '023','ref_06004' => '5'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '024','ref_06004' => '5'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '025','ref_06004' => '5'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '026','ref_06004' => '6'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '027','ref_06004' => '6'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '028','ref_06004' => '6'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '029','ref_06004' => '6'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '030','ref_06004' => '6'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '031','ref_06004' => '7'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '032','ref_06004' => '7'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '033','ref_06004' => '7'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '034','ref_06004' => '7'],
            ['ref_06002' => "መምልኢ ቦታ 1",'ref_06003' => '035','ref_06004' => '7'],

        ))->create();
    }
}
